<?xml version="1.0" ?>
<net name="text-recognition-0012" version="10">
	<layers>
		<layer id="0" name="Placeholder" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1,32,120"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_4653/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul1_4503/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_4655/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add1_4504/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Mul1_4491/Fused_Mul_48214823_const" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="64,1,3,3" size="2304"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="shadow/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_46584663/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2312" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Add1_4492/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="shadow/BatchNorm_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="shadow/MaxPool2D/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Mul1_4515/Fused_Mul_48254827_const" type="Const" version="opset1">
			<data element_type="f32" offset="2568" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="shadow/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_46664671/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="297480" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Add1_4516/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="shadow/BatchNorm_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="shadow/MaxPool2D_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Mul1_4467/Fused_Mul_48294831_const" type="Const" version="opset1">
			<data element_type="f32" offset="297992" shape="256,128,3,3" size="1179648"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="shadow/Conv_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_46744679/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1477640" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Add1_4468/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="shadow/BatchNorm_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Mul1_4479/Fused_Mul_48334835_const" type="Const" version="opset1">
			<data element_type="f32" offset="1478664" shape="256,256,3,3" size="2359296"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="shadow/Conv_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_46824687/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3837960" shape="1,256,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Add1_4480/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="shadow/BatchNorm_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="shadow/MaxPool2D_2/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,1" pads_begin="0,0" pads_end="0,0" strides="2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Mul1_4443/Fused_Mul_48374839_const" type="Const" version="opset1">
			<data element_type="f32" offset="3838984" shape="512,256,3,3" size="4718592"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="shadow/Conv_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_46904695/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="8557576" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Add1_4444/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="shadow/BatchNorm_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Mul1_4455/Fused_Mul_48414843_const" type="Const" version="opset1">
			<data element_type="f32" offset="8559624" shape="512,512,3,3" size="9437184"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="shadow/Conv_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_46984703/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="17996808" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Add1_4456/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="shadow/BatchNorm_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="shadow/MaxPool2D_3/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,1" pads_begin="0,0" pads_end="0,0" strides="2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>4</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Mul1_/Fused_Mul_48454847_const" type="Const" version="opset1">
			<data element_type="f32" offset="17998856" shape="512,512,2,2" size="4194304"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="shadow/Conv_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,1" strides="2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_47064711/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="22193160" shape="1,512,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Add1_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="shadow/BatchNorm_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="shadow/BatchNorm_7/Relu/Transpose/Cast_16254_const" type="Const" version="opset1">
			<data element_type="i64" offset="22195208" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="shadow/BatchNorm_7/Relu/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="shadow/Squeeze/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="22195240" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="shadow/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_4/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/Enter_3/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="2" internal_layer_id="4"/>
				<input external_port_id="1" internal_layer_id="3"/>
				<input axis="1" external_port_id="0" internal_layer_id="0" start="0"/>
				<output axis="1" external_port_id="3" internal_layer_id="13"/>
			</port_map>
			<back_edges>
				<edge from-layer="10" to-layer="3"/>
				<edge from-layer="9" to-layer="4"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="32" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,512"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="25_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="34" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="36" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Split270_const" type="Const" version="opset1">
						<data element_type="f32" offset="22272260" shape="1024,512" size="2097152"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Split271_const" type="Const" version="opset1">
						<data element_type="f32" offset="24369412" shape="1024,256" size="1048576"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/BiasAdd/Enter/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f32" offset="25417988" shape="1024" size="4096"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell" type="LSTMCell" version="opset1">
						<data hidden_size="256"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="2">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="3">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
							<port id="4">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
							<port id="5">
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="7" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Output_1/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="10" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="11" name="28_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Output_0/Data_/OutputUnsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="30/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="8" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="8" to-port="1"/>
					<edge from-layer="4" from-port="0" to-layer="8" to-port="2"/>
					<edge from-layer="5" from-port="1" to-layer="8" to-port="3"/>
					<edge from-layer="6" from-port="1" to-layer="8" to-port="4"/>
					<edge from-layer="7" from-port="1" to-layer="8" to-port="5"/>
					<edge from-layer="8" from-port="7" to-layer="9" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="10" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="12" to-port="0"/>
					<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
					<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="51" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/Enter_4/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/Enter_3/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="2" internal_layer_id="4"/>
				<input external_port_id="1" internal_layer_id="3"/>
				<input axis="1" end="0" external_port_id="0" internal_layer_id="0" start="-1" stride="-1"/>
				<output axis="1" end="0" external_port_id="3" internal_layer_id="12" start="-1" stride="-1"/>
			</port_map>
			<back_edges>
				<edge from-layer="13" to-layer="3"/>
				<edge from-layer="9" to-layer="4"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="32" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,512"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="25_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="34" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="36" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Split270_const" type="Const" version="opset1">
						<data element_type="f32" offset="25422084" shape="1024,512" size="2097152"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Split271_const" type="Const" version="opset1">
						<data element_type="f32" offset="27519236" shape="1024,256" size="1048576"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/BiasAdd/Enter/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f32" offset="28567812" shape="1024" size="4096"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell" type="LSTMCell" version="opset1">
						<data hidden_size="256"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="2">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="3">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
							<port id="4">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
							<port id="5">
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="7" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Output_1/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="10" name="28_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Output_0/Data_/OutputUnsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="30/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="13" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="8" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="8" to-port="1"/>
					<edge from-layer="4" from-port="0" to-layer="8" to-port="2"/>
					<edge from-layer="5" from-port="1" to-layer="8" to-port="3"/>
					<edge from-layer="6" from-port="1" to-layer="8" to-port="4"/>
					<edge from-layer="7" from-port="1" to-layer="8" to-port="5"/>
					<edge from-layer="8" from-port="7" to-layer="9" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="11" to-port="0"/>
					<edge from-layer="10" from-port="1" to-layer="11" to-port="1"/>
					<edge from-layer="11" from-port="2" to-layer="12" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="13" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="54" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_0/concat" type="Concat" version="opset1">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/Enter_3/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/Enter_4/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="2" internal_layer_id="3"/>
				<input axis="1" external_port_id="0" internal_layer_id="0" start="0"/>
				<input external_port_id="1" internal_layer_id="4"/>
				<output axis="1" external_port_id="3" internal_layer_id="13"/>
			</port_map>
			<back_edges>
				<edge from-layer="9" to-layer="4"/>
				<edge from-layer="10" to-layer="3"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="32" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,512"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="25_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="36" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="34" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Split270_const" type="Const" version="opset1">
						<data element_type="f32" offset="28571908" shape="1024,512" size="2097152"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Split271_const" type="Const" version="opset1">
						<data element_type="f32" offset="30669060" shape="1024,256" size="1048576"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/BiasAdd/Enter/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f32" offset="31717636" shape="1024" size="4096"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell" type="LSTMCell" version="opset1">
						<data hidden_size="256"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="2">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="3">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
							<port id="4">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
							<port id="5">
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="7" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Output_1/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="10" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Output_0/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="11" name="28_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="12" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/fw/fw/while/lstm_cell/concat/LSTMCell/Output_0/Data_/OutputUnsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="13" name="30/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="8" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="8" to-port="1"/>
					<edge from-layer="4" from-port="0" to-layer="8" to-port="2"/>
					<edge from-layer="5" from-port="1" to-layer="8" to-port="3"/>
					<edge from-layer="6" from-port="1" to-layer="8" to-port="4"/>
					<edge from-layer="7" from-port="1" to-layer="8" to-port="5"/>
					<edge from-layer="8" from-port="7" to-layer="9" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="10" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="12" to-port="0"/>
					<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
					<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="58" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/Enter_4/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/Enter_3/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="22195248" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/LoopCond/TensorIteratorCondition_/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="2" internal_layer_id="4"/>
				<input external_port_id="1" internal_layer_id="3"/>
				<input axis="1" end="0" external_port_id="0" internal_layer_id="0" start="-1" stride="-1"/>
				<output axis="1" end="0" external_port_id="3" internal_layer_id="12" start="-1" stride="-1"/>
			</port_map>
			<back_edges>
				<edge from-layer="13" to-layer="3"/>
				<edge from-layer="9" to-layer="4"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="32" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,512"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="25_const" type="Const" version="opset1">
						<data element_type="i64" offset="22195240" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="34" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="36" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,256"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Split270_const" type="Const" version="opset1">
						<data element_type="f32" offset="31721732" shape="1024,512" size="2097152"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Split271_const" type="Const" version="opset1">
						<data element_type="f32" offset="33818884" shape="1024,256" size="1048576"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/lstm_cell/BiasAdd/Enter/Output_0/Data__const" type="Const" version="opset1">
						<data element_type="f32" offset="34867460" shape="1024" size="4096"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1024</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell" type="LSTMCell" version="opset1">
						<data hidden_size="256"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>512</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="2">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="3">
								<dim>1024</dim>
								<dim>512</dim>
							</port>
							<port id="4">
								<dim>1024</dim>
								<dim>256</dim>
							</port>
							<port id="5">
								<dim>1024</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
							<port id="7" precision="FP32">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="shadow/LSTMLayers/encoder/stack_bidirectional_rnn/cell_1/bidirectional_rnn/bw/bw/while/lstm_cell/concat/LSTMCell/Output_1/Data_/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>256</dim>
							</port>
						</input>
					</layer>
					<layer id="10" name="28_const" type="Const" version="opset1">
